Repository: ystk/debian-grub2
Catalog: debian/po/*.po
Languages: tr

source: Chainload from menu.lst?
tr: menu.lst dosyasından zincirleme yükleme yapılsın mı?

source: GRUB upgrade scripts have detected a GRUB Legacy setup in /boot/grub.
tr: GRUB güncelleme betikleri /boot/grub altında eski bir GRUB kurulumu algıladı.

source: In order to replace the Legacy version of GRUB in your system, it is recommended that /boot/grub/menu.lst is adjusted to load a GRUB 2 boot image from your existing GRUB Legacy setup. This step can be automatically performed now.
tr: Sisteminizdeki eski sürüm GRUB kurulumunu değiştirmek için, /boot/grub/menu.lst dosyasının bir GRUB 2 önyükleme görüntüsünü varolan eski GRUB kurulumundan yüklenmesine olanak tanıyacak şekilde değiştirilmesi gerekmektedir. Bu adım şimdi kendiliğinden gerçekleştirilebilir.

source: It's recommended that you accept chainloading GRUB 2 from menu.lst, and verify that the new GRUB 2 setup works before it is written to the MBR (Master Boot Record).
tr: Yeni GRUB 2 kurulumu Ana Yükleme Kaydı'na (MBR) yazılmadan önce menu.lst'den GRUB 2 zincirleme önyüklemesini kabul etmeniz ve GRUB 2 kurulumunun çalıştığını doğrulamanız önerilir.

source: Whatever your decision, you can replace the old MBR image with GRUB 2 later by issuing the following command as root:
tr: Seçiminiz ne olursa olsun, root kimliği ile aşağıdaki komutu işleterek eski MBR görüntüsünü GRUB 2 ile değiştirebilirsiniz:

source: GRUB install devices:
tr: GRUB kurulum aygıtları:

source: The grub-pc package is being upgraded. This menu allows you to select which devices you'd like grub-install to be automatically run for, if any.
tr: grub-pc paketi yükseltiliyor. Bu menü, eğer varsa, grub-kur'un (grub-install) hangi aygıtlar için kendiliğinden çalışmasını seçmenize olanak tanır.

source: Running grub-install automatically is recommended in most situations, to prevent the installed GRUB core image from getting out of sync with GRUB modules or grub.cfg.
tr: GRUB çekirdek görüntüsünün kurulmuş GRUB modülleri ya da grub.cfg ile eşitliğinin/uyumunun bozulmasını engellemek için, çoğu durumda grub-kur'un (grub-install) kendiliğinden çalıştırılması önerilir.

source: If you're unsure which drive is designated as boot drive by your BIOS, it is often a good idea to install GRUB to all of them.
tr: Eğer hangi sürücünün BIOS'unuz tarafından yükleme sürücüsü olarak belirlendiğinden emin değilseniz, GRUB'u tüm sürücülere kurmak yerinde olacaktır.

source: Note: it is possible to install GRUB to partition boot records as well, and some appropriate partitions are offered here. However, this forces GRUB to use the blocklist mechanism, which makes it less reliable, and therefore is not recommended.
tr: Not: GRUB'u disk bölümlerinin yükleme kayıtlarına yüklemek de olanak dahilindedir ve duruma uygun bazı bölümler burada listelenmiştir. Öte yandan, bu seçim GRUB'u daha az güvenilir kılan engelleme listesi (blocklist) mekanizmasını kullanmaya zorlayacağından önerilmemektedir.

source: The GRUB boot loader was previously installed to a disk that is no longer present, or whose unique identifier has changed for some reason. It is important to make sure that the installed GRUB core image stays in sync with GRUB modules and grub.cfg. Please check again to make sure that GRUB is written to the appropriate boot devices.
tr: GRUB önyükleyici şu anda var olmayan ya da benzersiz tanımlayıcısı bir şekilde değişmiş bir diske kurulmuş durumdadır. Bu önyükleyicinin GRUB çekirdek görüntüsü ve grub.cfg ile uyum içinde olduğundan emin olmak önemlidir. Bu nedenle GRUB'un doğru önyükleme aygıtlarına yazılmış olduğundan emin olunuz.

source: Writing GRUB to boot device failed - continue?
tr: GRUB'u önyükleme aygıtına yazma işlemi başarısız oldu. Yine de devam edilsin mi?

source: GRUB failed to install to the following devices:
tr: Aşağıdaki aygıtlara GRUB kurulumu başarısız oldu:

source: Do you want to continue anyway? If you do, your computer may not start up properly.
tr: Yine de devam edilsin mi? Devam edilirse bilgisayarınız düzgün başlamayabilir.

source: Writing GRUB to boot device failed - try again?
tr: GRUB'u önyükleme aygıtına yazma işlemi başarısız oldu. Tekrar denensin mi?

source: You may be able to install GRUB to some other device, although you should check that your system will boot from that device. Otherwise, the upgrade from GRUB Legacy will be canceled.
tr: GRUB'u başka bir aygıta kurma seçeneğiniz olabilir, bununla birlikte sisteminizin o aygıttan başlayabileceğini denetlemeniz gerekmektedir. Aksi durumda, eski GRUB'un yükseltilmesi yapılmayacaktır.

source: Continue without installing GRUB?
tr: GRUB kurulmadan devam edilsin mi?

source: You chose not to install GRUB to any devices. If you continue, the boot loader may not be properly configured, and when this computer next starts up it will use whatever was previously in the boot sector. If there is an earlier version of GRUB 2 in the boot sector, it may be unable to load modules or handle the current configuration file.
tr: GRUB'u hiçbir aygıta kurmamayı seçtiniz. Devam ederseniz önyükleyici düzgün yapılandırılmayabilir ve bu bilgisayar bir sonraki açılışında önyükleme bölümünde daha önceden ne varsa onu kullanır. Eger önyükleme bölümünde GRUB 2'nin daha önceki bir sürümü var ise, güncel yapılandırma dosyasını kullanamayabilir ya da birimleri yükleyemeyebilir.

source: If you are already using a different boot loader and want to carry on doing so, or if this is a special environment where you do not need a boot loader, then you should continue anyway. Otherwise, you should install GRUB somewhere.
tr: Şu anda başka bir önyükleyici kullanıyorsanız ve kullanmaya da devam edecekseniz ya da bu sizin bir önyükleniciye gerek duymadığınız özel bir ortam ise bu şekilde devam edebilirsiniz. Aksi durumda, GRUB'u bir yere yüklemek zorundasınız.

source: Remove GRUB 2 from /boot/grub?
tr: /boot/grub yolundan GRUB 2 kaldırılsın mı?

source: Do you want to have all GRUB 2 files removed from /boot/grub?
tr: /boot/grub yolundan bütün GRUB 2 dosyalarının kaldırılmasını istiyor musunuz?

source: This will make the system unbootable unless another boot loader is installed.
tr: Başka bir önyükleyici kurulmadıysa yapılan bu işlem sistemi başlatılamaz kılacaktır.

source: Finish conversion to GRUB 2 now?
tr: GRUB 2'ye dönüşüm bitirilsin mi?

source: This system still has files from the GRUB Legacy boot loader installed, but it now also has GRUB 2 boot records installed on these disks:
tr: Bu sistemde hala eski GRUB kurulumundan kalan önyükleme dosyaları var, aynı zamanda da şu disklere yazılmış GRUB 2 önyükleme kayıtlarına sahip:

source: It seems likely that GRUB Legacy is no longer in use, and that you should instead upgrade the GRUB 2 images on these disks and finish the conversion to GRUB 2 by removing old GRUB Legacy files. If you do not upgrade these GRUB 2 images, then they may be incompatible with the new packages and cause your system to stop booting properly.
tr: Göründüğü kadarı ile eski GRUB kurulumu artık kullanılmıyor, dolayısıyla bu disklerde eski GRUB dosyalarını kaldırıp GRUB 2 görüntülerine yükseltme yaparak dönüşümü tamamlamalısınız. Eğer bunları GRUB 2 görüntülerine yükseltmezseniz, yeni paketlerle uyum sorunları yaşanabilir ve bu durum sisteminizin gerektiği gibi başlamasına engel olabilir.

source: You should generally finish the conversion to GRUB 2 unless these boot records were created by a GRUB 2 installation on some other operating system.
tr: Bu önyükleme kayıtları başka bir işletim sistemindeki GRUB 2 kurulumu tarafından yaratılmadığı sürece GRUB 2 kurulumunu tamamlamanız gerekmektedir.

source: Linux command line:
tr: Linux komut satırı:

source: The following Linux command line was extracted from /etc/default/grub or the `kopt' parameter in GRUB Legacy's menu.lst. Please verify that it is correct, and modify it if necessary. The command line is allowed to be empty.
tr: Aşağıdaki Linux komut satırı /etc/default/grub'dan ya da eski GRUB menu.lst dosyasındaki 'kopt' parametresinden türetilmiştir. Doğruluğundan emin olun ya da düzeltin. Komut satırını boş bırakabilirsiniz.

source: Linux default command line:
tr: Öntanımlı Linux komut satırı:

source: The following string will be used as Linux parameters for the default menu entry but not for the recovery mode.
tr: Aşağıdaki dizge öntanımlı menü girişinin Linux parametreleri olarak kullanılacak fakat kurtarma kipi için kullanılmayacak.

source: kFreeBSD command line:
tr: kFreeBSD komut satırı:

source: The following kFreeBSD command line was extracted from /etc/default/grub or the `kopt' parameter in GRUB Legacy's menu.lst. Please verify that it is correct, and modify it if necessary. The command line is allowed to be empty.
tr: Aşağıdaki kFreeBSD komut satırı /etc/default/grub'dan ya da eski GRUB menu.lst dosyasındaki 'kopt' parametresinden türetilmiştir. Doğruluğundan emin olun ya da düzeltin. Komut satırını boş bırakabilirsiniz.

source: kFreeBSD default command line:
tr: Öntanımlı kFreeBSD komut satırı:

source: The following string will be used as kFreeBSD parameters for the default menu entry but not for the recovery mode.
tr: Aşağıdaki dizge öntanımlı menü girişinin kFreeBSD parametreleri olarak kullanılacak fakat kurtarma kipi için kullanılmayacak.

source: /boot/grub/device.map has been regenerated
tr: /boot/grub/device.map dosyası yeniden oluşturuldu

source: The file /boot/grub/device.map has been rewritten to use stable device names. In most cases, this should significantly reduce the need to change it in future, and boot menu entries generated by GRUB should not be affected.
tr: /boot/grub/device.map dosyası kararlı aygıt isimlerini kullanacak şekilde yeniden yazıldı. Bu işlem çoğu durumda ileride gerekebilecek bir düzenleme gereksinimini ciddi biçimde azaltır ve GRUB tarafından yaratılan önyükleme menüsü seçeneklerini etkilemez.

source: However, since more than one disk is present in the system, it is possible that the system is depending on the old device map. Please check whether there are any custom boot menu entries that rely on GRUB's (hdN) drive numbering, and update them if necessary.
tr: Öte yandan sistemde birden fazla disk olduğu için, sistemin eski aygıt eşlemine bağlı kalmış olması olasıdır. GRUB'un (hdN) sürücü numaralandırmasını kullanan herhangi bir özgün önyükleme menü şeçenegi olup olmadığını denetleyin ve gerekirse bunları güncelleyin.

source: If you do not understand this message, or if there are no custom boot menu entries, you can ignore this message.
tr: Bu uyarıyı anlayamazsanız ya da herhangi bir özgün önyükleme menü seçeneği yok ise, bu uyarıyı gözardı edebilirsiniz.
